Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(1, 200, 232, 200,  0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (1, 200, 232, 200, 3 3488        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (1, 200, 232, 200, 3 128         conv3d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (1, 200, 232, 200, 3 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (1, 200, 232, 200, 8 264         leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (1, 200, 232, 200, 8 32          conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (1, 200, 232, 200, 8 1736        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (1, 200, 232, 200, 8 32          conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (1, 200, 232, 200, 3 288         leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (1, 200, 232, 200, 3 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_Add (TensorFlowOpLa [(1, 200, 232, 200,  0           dropout[0][0]                    
                                                                 conv3d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (1, 200, 232, 200, 3 128         tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (1, 200, 232, 200, 3 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (1, 200, 232, 200, 8 264         leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (1, 200, 232, 200, 8 32          conv3d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (1, 200, 232, 200, 8 1736        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (1, 200, 232, 200, 8 32          conv3d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (1, 200, 232, 200, 3 288         leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (1, 200, 232, 200, 3 0           conv3d_6[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_Add_1 (TensorFlowOp [(1, 200, 232, 200,  0           dropout_1[0][0]                  
                                                                 tf_op_layer_Add[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (1, 200, 232, 200, 3 128         tf_op_layer_Add_1[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (1, 200, 232, 200, 3 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (1, 200, 232, 200, 8 264         leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (1, 200, 232, 200, 8 32          conv3d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (1, 200, 232, 200, 8 1736        leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (1, 200, 232, 200, 8 32          conv3d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (1, 200, 232, 200, 8 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (1, 200, 232, 200, 3 288         leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (1, 200, 232, 200, 3 0           conv3d_9[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_Add_2 (TensorFlowOp [(1, 200, 232, 200,  0           dropout_2[0][0]                  
                                                                 tf_op_layer_Add_1[0][0]          
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (1, 100, 116, 100, 6 55360       tf_op_layer_Add_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (1, 100, 116, 100, 6 256         conv3d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (1, 100, 116, 100, 6 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (1, 100, 116, 100, 1 64          conv3d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (1, 100, 116, 100, 1 64          conv3d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
dropout_3 (Dropout)             (1, 100, 116, 100, 6 0           conv3d_13[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_3 (TensorFlowOp [(1, 100, 116, 100,  0           dropout_3[0][0]                  
                                                                 conv3d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_3[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (1, 100, 116, 100, 1 64          conv3d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (1, 100, 116, 100, 1 64          conv3d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
dropout_4 (Dropout)             (1, 100, 116, 100, 6 0           conv3d_16[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_4 (TensorFlowOp [(1, 100, 116, 100,  0           dropout_4[0][0]                  
                                                                 tf_op_layer_Add_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_4[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (1, 100, 116, 100, 1 64          conv3d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (1, 100, 116, 100, 1 64          conv3d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
dropout_5 (Dropout)             (1, 100, 116, 100, 6 0           conv3d_19[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_5 (TensorFlowOp [(1, 100, 116, 100,  0           dropout_5[0][0]                  
                                                                 tf_op_layer_Add_4[0][0]          
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_5[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (1, 100, 116, 100, 1 64          conv3d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (1, 100, 116, 100, 1 64          conv3d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
dropout_6 (Dropout)             (1, 100, 116, 100, 6 0           conv3d_22[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_6 (TensorFlowOp [(1, 100, 116, 100,  0           dropout_6[0][0]                  
                                                                 tf_op_layer_Add_5[0][0]          
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (1, 50, 58, 50, 128) 221312      tf_op_layer_Add_6[0][0]          
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (1, 50, 58, 50, 128) 512         conv3d_23[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (1, 50, 58, 50, 128) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (1, 50, 58, 50, 32)  4128        leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (1, 50, 58, 50, 32)  27680       leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_25[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (1, 50, 58, 50, 128) 4224        leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
dropout_7 (Dropout)             (1, 50, 58, 50, 128) 0           conv3d_26[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_7 (TensorFlowOp [(1, 50, 58, 50, 128 0           dropout_7[0][0]                  
                                                                 conv3d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (1, 50, 58, 50, 128) 512         tf_op_layer_Add_7[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (1, 50, 58, 50, 128) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (1, 50, 58, 50, 32)  4128        leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_27[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (1, 50, 58, 50, 32)  27680       leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_28[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (1, 50, 58, 50, 128) 4224        leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
dropout_8 (Dropout)             (1, 50, 58, 50, 128) 0           conv3d_29[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_8 (TensorFlowOp [(1, 50, 58, 50, 128 0           dropout_8[0][0]                  
                                                                 tf_op_layer_Add_7[0][0]          
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (1, 50, 58, 50, 128) 512         tf_op_layer_Add_8[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (1, 50, 58, 50, 128) 0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (1, 50, 58, 50, 32)  4128        leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_30[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (1, 50, 58, 50, 32)  27680       leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_31[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv3d_32 (Conv3D)              (1, 50, 58, 50, 128) 4224        leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
dropout_9 (Dropout)             (1, 50, 58, 50, 128) 0           conv3d_32[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_9 (TensorFlowOp [(1, 50, 58, 50, 128 0           dropout_9[0][0]                  
                                                                 tf_op_layer_Add_8[0][0]          
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (1, 50, 58, 50, 128) 512         tf_op_layer_Add_9[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (1, 50, 58, 50, 128) 0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv3d_33 (Conv3D)              (1, 50, 58, 50, 32)  4128        leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_33[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv3d_34 (Conv3D)              (1, 50, 58, 50, 32)  27680       leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (1, 50, 58, 50, 32)  128         conv3d_34[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (1, 50, 58, 50, 32)  0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv3d_35 (Conv3D)              (1, 50, 58, 50, 128) 4224        leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
dropout_10 (Dropout)            (1, 50, 58, 50, 128) 0           conv3d_35[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_10 (TensorFlowO [(1, 50, 58, 50, 128 0           dropout_10[0][0]                 
                                                                 tf_op_layer_Add_9[0][0]          
__________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspo (1, 100, 116, 100, 6 221248      tf_op_layer_Add_10[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Identity_1 (TensorF [(1, 100, 116, 100,  0           tf_op_layer_Add_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(1, 100, 116, 100,  0           conv3d_transpose[0][0]           
                                                                 tf_op_layer_Identity_1[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (1, 100, 116, 100, 1 512         tf_op_layer_concat[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv3d_36 (Conv3D)              (1, 100, 116, 100, 1 2064        leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (1, 100, 116, 100, 1 64          conv3d_36[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv3d_37 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (1, 100, 116, 100, 1 64          conv3d_37[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv3d_38 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_35[0][0]             
__________________________________________________________________________________________________
dropout_11 (Dropout)            (1, 100, 116, 100, 6 0           conv3d_38[0][0]                  
__________________________________________________________________________________________________
conv3d_39 (Conv3D)              (1, 100, 116, 100, 6 8256        tf_op_layer_concat[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Add_11 (TensorFlowO [(1, 100, 116, 100,  0           dropout_11[0][0]                 
                                                                 conv3d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_11[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv3d_40 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (1, 100, 116, 100, 1 64          conv3d_40[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv3d_41 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_37[0][0]             
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (1, 100, 116, 100, 1 64          conv3d_41[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv3d_42 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_38[0][0]             
__________________________________________________________________________________________________
dropout_12 (Dropout)            (1, 100, 116, 100, 6 0           conv3d_42[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_12 (TensorFlowO [(1, 100, 116, 100,  0           dropout_12[0][0]                 
                                                                 tf_op_layer_Add_11[0][0]         
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_12[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv3d_43 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_39[0][0]             
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (1, 100, 116, 100, 1 64          conv3d_43[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv3d_44 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (1, 100, 116, 100, 1 64          conv3d_44[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv3d_45 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_41[0][0]             
__________________________________________________________________________________________________
dropout_13 (Dropout)            (1, 100, 116, 100, 6 0           conv3d_45[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_13 (TensorFlowO [(1, 100, 116, 100,  0           dropout_13[0][0]                 
                                                                 tf_op_layer_Add_12[0][0]         
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (1, 100, 116, 100, 6 256         tf_op_layer_Add_13[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (1, 100, 116, 100, 6 0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv3d_46 (Conv3D)              (1, 100, 116, 100, 1 1040        leaky_re_lu_42[0][0]             
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (1, 100, 116, 100, 1 64          conv3d_46[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv3d_47 (Conv3D)              (1, 100, 116, 100, 1 6928        leaky_re_lu_43[0][0]             
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (1, 100, 116, 100, 1 64          conv3d_47[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_44 (LeakyReLU)      (1, 100, 116, 100, 1 0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv3d_48 (Conv3D)              (1, 100, 116, 100, 6 1088        leaky_re_lu_44[0][0]             
__________________________________________________________________________________________________
dropout_14 (Dropout)            (1, 100, 116, 100, 6 0           conv3d_48[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_14 (TensorFlowO [(1, 100, 116, 100,  0           dropout_14[0][0]                 
                                                                 tf_op_layer_Add_13[0][0]         
__________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTrans (1, 200, 232, 200, 3 55328       tf_op_layer_Add_14[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Identity (TensorFlo [(1, 200, 232, 200,  0           tf_op_layer_Add_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo [(1, 200, 232, 200,  0           conv3d_transpose_1[0][0]         
                                                                 tf_op_layer_Identity[0][0]       
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (1, 200, 232, 200, 6 256         tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_45 (LeakyReLU)      (1, 200, 232, 200, 6 0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv3d_49 (Conv3D)              (1, 200, 232, 200, 8 520         leaky_re_lu_45[0][0]             
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (1, 200, 232, 200, 8 32          conv3d_49[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_46 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv3d_50 (Conv3D)              (1, 200, 232, 200, 8 1736        leaky_re_lu_46[0][0]             
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (1, 200, 232, 200, 8 32          conv3d_50[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_47 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv3d_51 (Conv3D)              (1, 200, 232, 200, 3 288         leaky_re_lu_47[0][0]             
__________________________________________________________________________________________________
dropout_15 (Dropout)            (1, 200, 232, 200, 3 0           conv3d_51[0][0]                  
__________________________________________________________________________________________________
conv3d_52 (Conv3D)              (1, 200, 232, 200, 3 2080        tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
tf_op_layer_Add_15 (TensorFlowO [(1, 200, 232, 200,  0           dropout_15[0][0]                 
                                                                 conv3d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (1, 200, 232, 200, 3 128         tf_op_layer_Add_15[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_48 (LeakyReLU)      (1, 200, 232, 200, 3 0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
conv3d_53 (Conv3D)              (1, 200, 232, 200, 8 264         leaky_re_lu_48[0][0]             
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (1, 200, 232, 200, 8 32          conv3d_53[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_49 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv3d_54 (Conv3D)              (1, 200, 232, 200, 8 1736        leaky_re_lu_49[0][0]             
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (1, 200, 232, 200, 8 32          conv3d_54[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_50 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
conv3d_55 (Conv3D)              (1, 200, 232, 200, 3 288         leaky_re_lu_50[0][0]             
__________________________________________________________________________________________________
dropout_16 (Dropout)            (1, 200, 232, 200, 3 0           conv3d_55[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_16 (TensorFlowO [(1, 200, 232, 200,  0           dropout_16[0][0]                 
                                                                 tf_op_layer_Add_15[0][0]         
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (1, 200, 232, 200, 3 128         tf_op_layer_Add_16[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_51 (LeakyReLU)      (1, 200, 232, 200, 3 0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
conv3d_56 (Conv3D)              (1, 200, 232, 200, 8 264         leaky_re_lu_51[0][0]             
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (1, 200, 232, 200, 8 32          conv3d_56[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_52 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_52[0][0]     
__________________________________________________________________________________________________
conv3d_57 (Conv3D)              (1, 200, 232, 200, 8 1736        leaky_re_lu_52[0][0]             
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (1, 200, 232, 200, 8 32          conv3d_57[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_53 (LeakyReLU)      (1, 200, 232, 200, 8 0           batch_normalization_53[0][0]     
__________________________________________________________________________________________________
conv3d_58 (Conv3D)              (1, 200, 232, 200, 3 288         leaky_re_lu_53[0][0]             
__________________________________________________________________________________________________
dropout_17 (Dropout)            (1, 200, 232, 200, 3 0           conv3d_58[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Add_17 (TensorFlowO [(1, 200, 232, 200,  0           dropout_17[0][0]                 
                                                                 tf_op_layer_Add_16[0][0]         
__________________________________________________________________________________________________
conv3d_59 (Conv3D)              (1, 200, 232, 200, 1 33          tf_op_layer_Add_17[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Sigmoid (TensorFlow [(1, 200, 232, 200,  0           conv3d_59[0][0]                  
==================================================================================================
Total params: 806,369
Trainable params: 802,529
Non-trainable params: 3,840
__________________________________________________________________________________________________
